export const ProductDescription = () => {
  return (
    <div>
      <div className={`text-xl`}>
        Описание квартиры расположенной на микрорайоне джал. Полный адрес указан
        как джал-23 34б. Квартиру пытаются купить два подозрительных человека
        которые хотели бы на время спрятать, утаиться в этой квартире. Описание
        квартиры расположенной на микрорайоне джал. Полный адрес указан как
        джал-23 34б. Квартиру пытаются купить два подозрительных человека
        которые хотели бы на время спрятать, утаиться в этой квартире. Описание
        квартиры расположенной на микрорайоне джал. Полный адрес указан как
        джал-23 34б. Квартиру пытаются купить два подозрительных человека
        которые хотели бы на время спрятать, утаиться в этой квартире. Описание
        квартиры расположенной на микрорайоне джал. Полный адрес указан как
        джал-23 34б. Квартиру пытаются купить два подозрительных человека
        которые хотели бы на время спрятать, утаиться в этой квартире. Описание
        квартиры расположенной на микрорайоне джал. Полный адрес указан как
        джал-23 34б. Квартиру пытаются купить два подозрительных человека
        которые хотели бы на время спрятать, утаиться в этой квартире. Описание
        квартиры расположенной на микрорайоне джал. Полный адрес указан как
        джал-23 34б. Квартиру пытаются купить два подозрительных человека
        которые хотели бы на время спрятать, утаиться в этой квартире.
      </div>
    </div>
  )
}
