const data = [
  {
    subdata: [
      { name: 'Справочный центр' },
      { name: 'Тарифы и цены' },
      { name: 'Проверка недвижимости' },
    ],
  },
  {
    subdata: [
      { name: 'Юридические документы' },
      { name: 'Реклама Циана на ТВ' },
      { name: 'Карта сайта' },
    ],
  },
  {
    subdata: [
      { name: 'Поиск на карте' },
      { name: 'Продвижение' },
      { name: 'Свежие объявления' },
    ],
  },
  {
    subdata: [
      { name: 'Аукцион' },
      { name: 'Вакансии агентств' },
      { name: 'Карьера в Циане' },
    ],
  },
  {
    subdata: [
      { name: 'Реклама на сайте' },
      { name: 'Помощь' },
      { name: 'Сайт для инвесторов' },
    ],
  },
  {
    subdata: [
      { name: 'Программа «Суперагенты»' },
      { name: 'Ипотечный калькулятор' },
    ],
  },
]

export const Footer = () => {
  return (
    <footer className={`bg-gray-200 py-5`}>
      <div className={`max-w-screen-2xl mx-auto px-2 space-y-5`}>
        <div
          className={`grid  grid-cols-2 sm:grid-cols-3 md:grid-cols-4 lg:grid-cols-5`}
        >
          {data.map(({ subdata }, index) => (
            <ul key={index} className={`flex flex-col gap-1`}>
              {subdata.map((el, i) => (
                <li
                  key={i}
                  className={`text-gray-500 md:hover:underline duration-300 cursor-pointer inline`}
                >
                  {el.name}
                </li>
              ))}
            </ul>
          ))}
        </div>
        <div>
          <p className={`text-gray-500`}>
            Циан — база проверенных объявлений о продаже и аренде жилой,
            загородной и коммерческой недвижимости. Онлайн-сервис №1 в России в
            категории «Недвижимость», по данным Similarweb на сентябрь 2023 г.
            Используя сервис, вы соглашаетесь с Пользовательским соглашением и
            Политикой конфиденциальности Циан. Оплачивая услуги, вы принимаете
            Лицензионное соглашение. ООО «Айриэлтор», email: support@cian.ru. На
            информационном ресурсе применяются Рекомендательные технологии.
          </p>
        </div>
        <div className={`bg-gray-500 h-[1px] w-full`}></div>
        <div className={`flex justify-between items-center`}>
          <div>
            <img
              src="data:image/svg+xml;charset=utf-8,%3Csvg xmlns='http://www.w3.org/2000/svg' width='66' height='24' fill='none'%3E%3Cpath fill='%23152242' d='M11.7 5.478c-.928 0-1.68-.759-1.68-1.695s.752-1.694 1.68-1.694c.927 0 1.68.758 1.68 1.694 0 .936-.753 1.695-1.68 1.695Zm0-5.382c-2.024 0-3.664 1.655-3.664 3.696a3.7 3.7 0 0 0 .744 2.232l.243.34 2.676 3.256 2.92-3.597a3.7 3.7 0 0 0 .744-2.231c0-2.041-1.64-3.696-3.664-3.696Zm1.398 17.172v-6.202h-2.714v2.913l-2.712-3.287L.12 19.845l2.512 2.11 5.04-6.109 5.04 6.108 2.512-2.109-2.126-2.577Zm16.644-6.211h-2.407v8.455H22.58v-8.455h-2.407v10.7h8.862v2.147h2.18v-4.392h-1.472v-8.455Zm5.562 7.203v-7.203h-2.407v10.7h2.407l5.04-7.204v7.204h2.407v-10.7h-2.407l-5.04 7.204Zm28.184-7.203v4.205h-4.913v-4.205h-2.407v10.7h2.407v-4.235h4.913v4.235h2.392v-10.7h-2.392ZM51.444 17.24c0 .84-.236 1.496-.7 1.953-.47.461-1.153.696-2.03.696-1.096 0-1.7-.498-1.7-1.403 0-.944.79-1.508 2.112-1.508h2.318v.261Zm-2.009-6.387c-1.257 0-2.34.34-3.133.982a3.29 3.29 0 0 0-1.238 2.364h2.372c.108-.496.634-1.27 2-1.27 1.257 0 2.008.757 2.008 2.025v.054h-2.42c-1.434 0-2.541.327-3.291.971-.719.618-1.084 1.496-1.084 2.61 0 .961.375 1.823 1.056 2.427.698.62 1.668.948 2.804.948 1.78 0 2.748-.877 3.08-1.252l.166.917.023.127h2.031v-6.801c0-2.53-1.676-4.102-4.374-4.102Z'/%3E%3C/svg%3E"
              alt="cian"
            />
          </div>
          <div>
            <span>&copy; Все права защищены Эркебулан и Микаиль</span>
            <span
              className={`ml-4 size-5 bg-gray-400 rounded-full p-1 text-xl`}
            >
              +0
            </span>
          </div>
        </div>
      </div>
    </footer>
  )
}
